# 6.1 Reading and Writing Data in Text Format

In [7]:
import pandas as pd

In [8]:
%pwd

'/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/Practices'

In [9]:
# Use the unix cat shell command to print the raw contents of the file to the screen 
!cat '/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex1.csv'

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [10]:
df = pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
pd.read_table('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex1.csv', 
              sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
!cat '/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex2.csv'

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [13]:
pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex2.csv', 
            header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [14]:
pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex2.csv', 
            names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
names = ['a','b','c','d','message']

pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex2.csv',
             names = names,
             index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [16]:
!cat '/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/csv_mindex.csv'

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [17]:
parsed = pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/csv_mindex.csv',
                     index_col = ['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [18]:
list(open('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [19]:
# pass a regular expression as a delimiter for read_table 
result = pd.read_table('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex3.txt', 
                       sep = '\s+') 
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [20]:
!cat '/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex4.csv'

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [21]:
pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex4.csv', 
            skiprows = [0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
!cat '/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex5.csv'

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [23]:
result = pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [25]:
result = pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex5.csv', 
                     na_values = ['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [26]:
sentinels = {'message': ['foo', 'NA'],
             'something': ['two']}

pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex5.csv',
            na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## 6.1.1 Reading text files in pieces

In [27]:
pd.options.display.max_rows = 10

In [28]:
result = pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [29]:
pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex6.csv', 
             nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [30]:
chunker = pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex6.csv', 
                      chunksize = 1000)
chunker

In [31]:
type(chunker)

pandas.io.parsers.TextFileReader

In [32]:
# The TextParser object returned by read_csv allows you to iterate over the parts of the file according to the chucksize
chunker = pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex6.csv',
                      chunksize = 1000)

tot = pd.Series([])

for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),
                  fill_value = 0)
tot = tot.sort_values(ascending = False)

<ipython-input-32-70721a4b9c21>:5: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [33]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## 6.1.2 Writing Data to Text Format

In [35]:
data = pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [36]:
data.to_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/out.csv')

In [37]:
!cat '/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/out.csv'

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [38]:
import sys

# writing to sys.stdout so it prints the text result to the console 
data.to_csv(sys.stdout, sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [43]:
data.to_csv(sys.stdout, na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [44]:
data.to_csv(sys.stdout, index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [45]:
data.to_csv(sys.stdout, index = False, columns = ['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [46]:
import numpy as np

dates = pd.date_range('1/1/2000', periods = 7)
ts = pd.Series(np.arange(7), index = dates)

ts.to_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/tseries.csv')
!cat '/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/tseries.csv'

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

## 6.1.3 Working with Delimited Formats

In [47]:
!cat '/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex7.csv'

"a","b","c"
"1","2","3"
"1","2","3"

In [49]:
import csv

f = open('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex7.csv')

reader = csv.reader(f)

for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [50]:
# read the file into a list of lines 
with open('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [51]:
# split the lines into the header line and the data lines 
header, values = lines[0], lines[1:]

In [52]:
# create a dictionary of data columns using a dictionary comprehension and the expression zip(*values), which transposes rows to columns
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [53]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [ ]:
reader = csv.reader(f, dialect = my_dialect)

In [ ]:
reader = csv.reader(f, delimiter='|')

In [ ]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

## 6.1.4 JSON Data

JSON - JavaScript Object Notation

In [55]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [56]:
type(obj)

str

In [57]:
import json

result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [58]:
type(result)

dict

In [59]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [60]:
type(asjson)

str

In [61]:
siblings = pd.DataFrame(result['siblings'],
                        columns = ['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [62]:
!cat '/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/example.json'

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [63]:
data = pd.read_json('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [64]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [65]:
print(data.to_json(orient = 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## 6.1.5 XML and HTML: Web Scraping

In [66]:
tables = pd.read_html('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/fdic_failed_bank_list.html')
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [67]:
len(tables)

1

In [68]:
type(tables)

list

In [69]:
type(tables[0])

pandas.core.frame.DataFrame

In [70]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [71]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [73]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

### Parsing XML with lxml.objectify

In [76]:
from lxml import objectify

path = '/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [77]:
type(root)

lxml.objectify.ObjectifiedElement

In [78]:
data = []
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ',
               'DESIRED_CHANGE','DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [79]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [80]:
from io import StringIO

tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [81]:
root

In [82]:
root.get('href')

'http://www.google.com'

In [83]:
root.text

'Google'

# 6.2 Binary Data Formats

One of the easiest ways to store data (also known as serialization) efficiently in binary format is using python's built-in pickle serialization. pandas objects all have a to_pickle method that writes the data to disk in pickle format

In [89]:
frame = pd.read_csv('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex1.csv')

In [90]:
frame.to_pickle('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/frame_pickle')

Read any 'pickled' object stored in a file by using the built-in pickle directly, or even more conveniently using pandas.read_pickle

In [92]:
pd.read_pickle('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Pickle is only recommended as a short-term storage format. The problem is that it is hard to guarantee that the format will be stable over time. An object pickled today may not unpickle with a later version of a library.

Other storage formats: HDF5, bcolz, Feather

Feather is a cross=language column-oriented file format. Feather uses the Apache Arrow columnar memory format

## 6.2.1 Using HDF5 Format

HDF5, Hierarchical Data Format, is a well-regarded file format intended for storing large quantities of scientific array data. It is available as a C library, and it has interfaces available in many other languages, including Java, Julia, MATLAB, and python.

Each HDF5 file can store multiple datasets and supporting metadata. Compared with simpler formats, HDF5 supports on-the-fly compression with a variety of compression modes, enabling data with repeated patterns to be stores more efficiently. HDF5 can be a good choice for working with very large datasets that don't fit into memory, as you can efficiently read and write small sections of much larger arrays.

In [120]:
frame = pd.DataFrame({'a': np.random.randn(100)})
frame

           a
0  -0.662990
1  -0.154663
2   0.873486
3   0.007056
4   0.919520
..       ...
95  0.263100
96 -0.004096
97 -0.116887
98  0.201375
99  0.380625

[100 rows x 1 columns]

In [121]:
store = pd.HDFStore('mydata.h5')

In [122]:
store['obj1'] = frame

In [123]:
store['obj1_col'] = frame['a']

In [124]:
type(store)

pandas.io.pytables.HDFStore

In [125]:
store['obj1']

           a
0  -0.662990
1  -0.154663
2   0.873486
3   0.007056
4   0.919520
..       ...
95  0.263100
96 -0.004096
97 -0.116887
98  0.201375
99  0.380625

[100 rows x 1 columns]

In [126]:
store.put('obj2', frame, format='table')

In [127]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.065784
11  1.803910
12 -0.754775
13  0.863277
14 -0.685715
15  1.046500

In [128]:
store.close()

In [129]:
frame.to_hdf('mydata.h5', 'obj3', format = 'table')

In [ ]:
pd.read_hdf('mydata.h5', 'obj3', where = ['index < 5'])

If processing data that is stored on remote servers, like Amazon S3 or HDFS, using a different binary format designed for distributed storage like Apache Parquet may be more suitable

If you work with large quantities of data locally, I would encourage you to explore
PyTables and h5py to see how they can suit your needs. Since many data analysis
problems are I/O-bound (rather than CPU-bound), using a tool like HDF5 can massively
accelerate your applications.

HDF5 is not a database. It is suited for write-once, read-many datasets. While data can be added to a file at any time, if multiple writers do so simultaneously, the file can become corrupted

## 6.2.2 Reading Microsoft Excel Files

In [132]:
xlsx = pd.ExcelFile('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex1.xlsx')

In [133]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [134]:
frame = pd.read_excel('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex1.xlsx',
                      'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [137]:
writer = pd.ExcelWriter('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex2.xlsx')

In [138]:
frame.to_excel(writer, 'Sheet1')
writer.save()

In [139]:
frame.to_excel('/Users/boyuan/Desktop/OneDrive/Python for data analysis 2nd/examples/ex2.xlsx')

# 6.3 Interacting with Web APIs

In [140]:
import requests

url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

resp = requests.get(url)
resp

In [141]:
data = resp.json()
data[0]['title']

'BUG: unexpected cut() results'

In [142]:
issues = pd.DataFrame(data,
                      columns = ['number', 'title', 'labels', 'state'])
issues.head()

,number,title,labels,state
0,35126,BUG: unexpected cut() results,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,35125,TST: Add test for category equalness on applie...,[],open
2,35124,BUG: Rounding on float16 type not working,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,35123,BUG: pandas does not build on AIX - when using...,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
4,35122,CLN: remove kwargs in Index.format,[],open

# 6.4 Interacting with Databases

In [144]:
import sqlite3

In [145]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);
"""

In [146]:
con = sqlite3.connect('mydata.sqlite')

In [147]:
con.execute(query)

OperationalError: table test already exists

In [148]:
con.commit()

In [149]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento','California',1.7,5)]
data

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [150]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [151]:
con.executemany(stmt,data)

In [152]:
con.commit()

In [153]:
cursor = con.execute('SELECT * FROM test')

In [154]:
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [155]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [156]:
pd.DataFrame(rows, columns = [x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5
6      Atlanta     Georgia  1.25  6
7  Tallahassee     Florida  2.60  3
8   Sacramento  California  1.70  5

In [164]:
import sqlalchemy as sqla

db = sqla.create_engine('sqlite:///mydata.sqlite')

pd.read_sql('SELECT * FROM test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5
6      Atlanta     Georgia  1.25  6
7  Tallahassee     Florida  2.60  3
8   Sacramento  California  1.70  5

# 6.5 Conclusion